///////////////////////////////////   القيود وما الفرق بينهم
/////////////////////////////////// comst and final:وهم عباره عن قيود تستخدم على المتغيرات وكلاهما لايسمحان للمتغيرات الذي قيد بهم ان يدخل اكثر من قيمة واحدة او تعديلها
// بعض الفروقات بين القيدين 
//const:
 // (compile time) مجبر على المبرمج ان يعرفها وقت  وقت كتابه البرنامج
///////////////مثال 
//const String name;//////Error

//const name = "omar";////////True

//final: (run time) غير مجبر على المبرمج ان يعرف القيم وقت كتابه الكود او البرنامج ولاكن يب ان نرسل له قيم وقت التنفيذ 
// final age;//
// age = 22;

////  var and dynamic ما هو ال  
//وهم نوع من انواع البيانات 

//الفرق بين كل منهم 
// var:نستطيع تغيير القيمة ولا نستطيع تغيير النوع البياني
// مثال  خطأ
// var name = "omar";//Error 
// var name  = 22;//Error 
 
// مثال صحيح
//
//var name="omar"
//var name ="akram";
//
//dynamic:   نستطيع تغيير القيمه والنوع البياني ويقوم بتعريفه تلقائياّ اذا لما نذكر نوع بياني للمتغير 
// مثال صحيح
 
// dynamic age = 22;
// age = "dfte";
//مثال اخر 
// age = true;
// name = "22";
// print("$age $name");//true 